<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-paid-features","backend_type":"remote","backend":"acef2cc61c6041a21434e49bde2582d67847197b9324b39d0be0ecb5e3c4106a","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #259 at https://github.com/scidsg/hushline/actions/runs/10798462794","plan_out_hash":"4364cc2b372bc87e554ad6bbadf7816f822b5695cbe313b60080d31e63c5226e","plan_hash":"32ee6d1e1c42ec1fc40c2196183ca3af5605410d64f7e236ee716692ea2ad05f","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-paid-features__ workspace<details open><summary>With variables</summary>

```hcl
branch = "paid-features"
name   = "dev-paid-features"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = "************************************"
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains  = (known after apply)
+           features = [
+               "buildpack-stack=ubuntu-22",
            ]
+           name     = "dev-paid-features"
+           region   = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "app"
+               run_command        = (known after apply)

+               github {
+                   branch         = "paid-features"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #259](https://github.com/scidsg/hushline/actions/runs/10798462794)